Documents/Увольнение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Увольнение</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.КадроваяИстория</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/КадроваяИстория.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КадроваяИстория</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Отделы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Уволен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Увольнение/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Проверка 1: дата увольнения не меньше даты документа
	Если ЗначениеЗаполнено(ДатаУвольнения) И ДатаУвольнения < НачалоДня(Дата) Тогда
		Сообщить("Ошибка: дата увольнения не может быть меньше даты документа!", СтатусСообщения.Важное);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Проверка 2: сотрудник принят и не уволен
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КадроваяИстория.Должность,
		|	КадроваяИстория.Отдел,
		|	КадроваяИстория.Оклад
		|ИЗ
		|	РегистрСведений.КадроваяИстория.СрезПоследних(
		|		&Дата,
		|	) КАК КадроваяИстория
		|ГДЕ
		|	КадроваяИстория.Сотрудник = &Сотрудник
		|	И КадроваяИстория.Должность <> ЗНАЧЕНИЕ(Справочник.Должности.ПустаяСсылка)
		|	И КадроваяИстория.Уволен = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Дата", ДатаУвольнения);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Сообщить("Ошибка: сотрудник не найден или уже уволен!", СтатусСообщения.Важное);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Получаем данные из запроса для записи в движение
	ВыборкаДанных = РезультатЗапроса.Выбрать();
	ВыборкаДанных.Следующий();
	
	
	// Записываем движение
	Движения.КадроваяИстория.Записывать = Истина;
	
	Движение = Движения.КадроваяИстория.Добавить();
	Движение.Период    = ДатаУвольнения;
	Движение.Сотрудник = Сотрудник;
	Движение.Отдел     = ВыборкаДанных.Отдел;
	Движение.Должность = ВыборкаДанных.Должность;
	Движение.Оклад     = ВыборкаДанных.Оклад;
	Движение.Уволен    = Истина;
	
КонецПроцедуры
